{
  "personal": {
    "name": "Alvaro Enrique Ruano",
    "location": "Guatemala City, Guatemala",
    "phone": "(+502) 5930-2117",
    "email": "alvaro.ruano90@outlook.com",
    "linkedin": "https://www.linkedin.com/in/aruanoguate",
    "github": "https://github.com/aruanoguate",
    "profileImage": "img/profile.jpg",
    "resumePdf": "generated-pdf/AlvaroRuano_Resume.pdf"
  },
  "summary": {
    "detailed": "Hands-on Technology Director with 15+ years of leadership experience across software engineering, architecture, DevOps, and QA operations. Proven track record of scaling engineering teams from startup to enterprise, delivering cloud-native SaaS platforms, and aligning technology strategy with business objectives in fast-paced B2B environments.<br><br>Expert in driving technical excellence while mentoring cross-functional teams, optimizing development pipelines, and designing scalable processes that support growth and operational stability. Passionate about cloud infrastructure, modern development practices, and emerging technologies including IoT and AI.<br><br>Skilled at bridging engineering and business domains—experienced in budget management, release planning, vendor integration, and stakeholder alignment. Seeking technology leadership roles or consulting opportunities where strategic vision and technical depth create measurable impact."
  },
  "contact": {
    "primary": [
      {
        "icon": "fab fa-linkedin-in",
        "text": "LinkedIn",
        "url": "https://www.linkedin.com/in/aruanoguate"
      },
      {
        "icon": "fas fa-file-pdf",
        "text": "Resume (PDF)",
        "url": "generated-pdf/AlvaroRuano_Resume.pdf",
        "download": "AlvaroRuano_Resume.pdf"
      }
    ],
    "contact": [
      {
        "icon": "fas fa-mobile-alt",
        "text": "(+502) 5930-2117",
        "url": "tel:50259302117"
      },
      {
        "icon": "fas fa-envelope-open-text",
        "text": "alvaro.ruano90@outlook.com",
        "url": "mailto:alvaro.ruano90@outlook.com"
      }
    ],
    "links": [
      {
        "icon": "fab fa-github",
        "text": "GitHub",
        "url": "https://github.com/aruanoguate"
      },
      {
        "icon": "fab fa-slideshare",
        "text": "SlideShare",
        "url": "https://www.slideshare.net/AlvaroRuano1/presentations"
      },
      {
        "icon": "fab fa-microsoft",
        "text": "Microsoft Learning",
        "url": "https://docs.microsoft.com/en-us/users/aruanoguate"
      },
      {
        "icon": "fab fa-youtube",
        "text": "Learning in Public",
        "url": "https://www.youtube.com/playlist?list=PLkejcRlNG49MzGYt8qpQ6sf7bJDAy2vL_"
      }
    ]
  },
  "experience": [
    {
      "title": "Director of Engineering",
      "company": "Relish",
      "companyUrl": "https://relishiq.com/",
      "period": "January 2022 – Present",
      "detailedDescription": "Lead technology strategy and execution for RelishIQ's enterprise procurement SaaS platform, overseeing software engineering, DevOps, architecture, and QA functions. Report directly to the CTO while bridging technology decisions with business objectives across a fast-growing B2B environment. Additionally served as interim VP of Engineering (February 2024 – December 2024), reporting directly to the CEO during a critical 11-month growth period and representing engineering interests in C-level strategic discussions.<br><br>Scale and mentor engineering teams through strategic growth phases, establishing architectural standards and development practices that support both current operations and future expansion. Drive cloud-native platform development using modern frameworks, ensuring security, scalability, and maintainability in our multi-tenant AWS and Azure environments.<br><br>Champion operational excellence by implementing cost optimization strategies, performance monitoring, and infrastructure automation that directly impact bottom-line results. Partner with vendors, cloud providers, and cross-functional stakeholders to negotiate technical solutions that balance innovation with business needs.<br><br>Foster a culture of technical excellence through hands-on mentorship, establishing quality standards, and promoting best practices across software engineering, automated testing, and CI/CD pipelines. Collaborate closely with InfoSec, Support, and Product teams to ensure technology decisions align with business strategy and customer success objectives."
    },
    {
      "title": "Software Engineering Manager",
      "company": "Conduent",
      "companyUrl": "https://www.conduent.com/",
      "period": "February 2017 – January 2022",
      "detailedDescription": "Built and led a high-performing engineering team of 14 developers and QA specialists supporting a mission-critical Workers Compensation SaaS platform. Established the leadership foundation that shaped my current approach to scaling teams and delivering enterprise software solutions.<br><br>Championed modern development practices by implementing SDLC standards, CI/CD pipelines, and coding best practices across multiple teams. Led the strategic migration from legacy .NET Web Forms to cloud-native Angular applications on Azure, while establishing infrastructure-as-code practices that drive my current platform strategies.<br><br>Managed diverse technical portfolios including data ingestion pipelines (XML, ANSI X12, PDF processing), business intelligence platforms (Crystal Reports, SAP Business Objects), and regulatory compliance systems. Implemented DevOps practices that significantly reduced deployment times and improved system reliability across all platform components.<br><br>Served as technical liaison between engineering and business stakeholders, translating complex compliance requirements into actionable development roadmaps. This role developed my skills in stakeholder management and business-technology alignment that are central to my current executive approach."
    },
    {
      "title": "Business Analyst",
      "company": "Conduent",
      "companyUrl": "https://www.conduent.com/",
      "period": "April 2015 – February 2017",
      "detailedDescription": "Served as the critical bridge between technical teams and business stakeholders for Workers Compensation SaaS platforms used for state government compliance reporting across the USA. This role cultivated my ability to translate complex business requirements into technical solutions—a skill that remains fundamental to my current leadership approach.<br><br>Operated as technical product owner, defining requirements for .NET Framework applications and SQL Server solutions while ensuring regulatory compliance across multiple state jurisdictions. The Workers Compensation domain required deep understanding of insurance regulations, medical billing processes, and state-specific compliance requirements.<br><br>Managed both technological and human resources to ensure smooth platform operations, establishing early experience in resource allocation and cross-functional coordination. This foundational experience in balancing technical excellence with strict regulatory business objectives directly influences my current philosophy of technology leadership."
    },
    {
      "title": "Senior Software Developer",
      "company": "Banco Agromercantil de Guatemala",
      "companyUrl": "https://www.bam.com.gt/",
      "period": "August 2011 – March 2015",
      "detailedDescription": "Evolved from Junior Developer to technical leader, directing critical software development projects and managing a team of six developers. This progression demonstrated early leadership potential while maintaining deep hands-on technical expertise in enterprise banking systems.<br><br>Led complex modernization initiatives including migration from legacy COBOL systems to .NET Framework and integration of third-party services into e-Banking platforms. Coordinated with Software Architects to establish technical standards and collaborated regularly with business stakeholders to align implementation strategies with organizational goals.<br><br>Developed expertise in enterprise-scale challenges through projects spanning core banking engine modules (COBIS), ETL processes for Business Objects BI platform, and custom ticketing systems for ISO 20,000 certification. Established proficiency in project planning using Microsoft Project and maintained production support responsibilities.<br><br>This role solidified my foundation in balancing technical excellence with business requirements—skills that continue to drive my approach to technology leadership and strategic decision-making."
    },
    {
      "title": "Junior Software Developer",
      "company": "Citi",
      "companyUrl": "https://www.citigroup.com/citi/",
      "period": "March 2011 – August 2011",
      "detailedDescription": "Launched professional career contributing to e-Banking systems across Central America, gaining essential foundation in enterprise software development and secure coding practices. Executed full Software Development Lifecycle responsibilities using SQL Server, .NET Framework, C#, and ASP.NET Web Forms within n-layer architectural patterns.<br><br>This early exposure to banking industry standards and security-first development practices established the technical rigor and attention to quality that continues to inform my leadership approach today."
    }
  ],
  "education": [
    {
      "degree": "Master of Business Administration",
      "institution": "ENAE Business School",
      "period": "2015 - n/a"
    },
    {
      "degree": "Master of Finance",
      "institution": "Universidad Rafael Landívar",
      "period": "2013 - 2015",
      "credentialUrl": "docs/mfin-diploma.jpg",
      "achievements": [
        "Academic Excellence Diploma"
      ]
    },
    {
      "degree": "Information Systems Engineering",
      "institution": "Universidad Rafael Landívar",
      "period": "2008 - 2013",
      "credentialUrl": "docs/engineer-diploma.jpg",
      "achievements": [
        "Magna Cum Laude",
        "Excellence in Values Award 2012 - Asociación de Estudiantes de Ingeniería (AEI)"
      ]
    }
  ],
  "certifications": [
    {
      "name": "Microsoft Certified: Azure Developer Associate",
      "issuer": "Microsoft",
      "period": "March 2021 - March 2023",
      "credentialUrl": "https://www.youracclaim.com/badges/7d40a49c-0e11-4e36-85aa-63219f203747"
    },
    {
      "name": "Microsoft Certified: Azure Data Fundamentals",
      "issuer": "Microsoft",
      "period": "May 2021",
      "credentialUrl": "https://www.credly.com/badges/4e01edf8-6d04-4590-be50-8922aea1cb8a"
    },
    {
      "name": "Microsoft Certified: Azure Fundamentals",
      "issuer": "Microsoft",
      "period": "November 2020",
      "credentialUrl": "https://www.youracclaim.com/badges/337c066f-71ef-4e0a-9d5e-4aa2811cca6a"
    },
    {
      "name": "Duolingo English Test",
      "issuer": "Duolingo",
      "period": "February 2020 - February 2022",
      "credentialUrl": "https://certs.duolingo.com/rjxgs8t5"
    }
  ],
  "skills": {
    "leadership": [
      "Engineering Team Leadership",
      "Software Development Lifecycle",
      "Agile/Scrum Methodologies",
      "Project Management",
      "Cross-functional Collaboration"
    ],
    "technical": [
      "Cloud Architecture (Azure, AWS)",
      "C#, .NET Framework/.NET Core",
      "JavaScript, TypeScript, Angular",
      "SQL Server, Database Design",
      "DevOps, CI/CD"
    ]
  },
  "collaborations": [
    {
      "name": "gitflow-in-azure-devops",
      "role": "creator of the utility",
      "url": "https://github.com/aruanoguate/gitflow-in-azure-devops",
      "description": "Creator of utility for Azure DevOps Git flow implementation"
    },
    {
      "name": "pretix-qpaypro",
      "role": "creator of the plug-in",
      "url": "https://pypi.org/project/pretix-qpaypro/",
      "description": "Creator of payment processing plugin"
    },
    {
      "name": "Pretix",
      "role": "collaborator",
      "url": "https://github.com/pretix/pretix",
      "description": "Collaborator on ticketing platform versions",
      "versions": [
        {
          "version": "v2.30",
          "url": "https://pretix.eu/about/en/blog/20181206-release-230/"
        },
        {
          "version": "v2.40",
          "url": "https://pretix.eu/about/en/blog/20190204-release-240/"
        },
        {
          "version": "v2.50",
          "url": "https://pretix.eu/about/en/blog/20190311-release-250/"
        },
        {
          "version": "v2.60",
          "url": "https://pretix.eu/about/en/blog/20190403-release-260/"
        }
      ]
    },
    {
      "name": "Visual Studio Code",
      "role": "translator",
      "url": "https://github.com/microsoft/vscode",
      "description": "Spanish translator for multiple versions",
      "versions": [
        {
          "version": "v1.31",
          "url": "https://code.visualstudio.com/updates/v1_31"
        },
        {
          "version": "v1.32",
          "url": "https://code.visualstudio.com/updates/v1_32"
        },
        {
          "version": "v1.33",
          "url": "https://code.visualstudio.com/updates/v1_33"
        },
        {
          "version": "v1.34",
          "url": "https://code.visualstudio.com/updates/v1_34"
        },
        {
          "version": "v1.37",
          "url": "https://code.visualstudio.com/updates/v1_37"
        },
        {
          "version": "v1.38",
          "url": "https://code.visualstudio.com/updates/v1_38"
        },
        {
          "version": "v1.43",
          "url": "https://code.visualstudio.com/updates/v1_43"
        }
      ]
    }
  ],
  "interests": {
    "summary": "Exploring the world, one adventure at a time! 🌍✈️ A passionate foodie on a delicious journey 🍽️. Engineer by trade, always curious about new tech 📱",
    "detailed": [
      "Technology Innovation",
      "Global Travel",
      "International Cuisine",
      "Cinema"
    ]
  },
  "social": [
    {
      "platform": "Instagram",
      "url": "https://www.instagram.com/aruano.gt",
      "icon": "fab fa-instagram"
    },
    {
      "platform": "Facebook",
      "url": "https://www.facebook.com/aruano.gt",
      "icon": "fab fa-facebook-f"
    },
    {
      "platform": "Twitter",
      "url": "https://twitter.com/aruanoguate",
      "icon": "fab fa-twitter"
    },
    {
      "platform": "Pinterest",
      "url": "https://www.pinterest.com/aruanogt",
      "icon": "fab fa-pinterest"
    }
  ],
  "languages": [
    {
      "language": "Spanish",
      "proficiency": "Native"
    },
    {
      "language": "English",
      "proficiency": "Proficient"
    }
  ],
  "meta": {
    "description": "Experienced software engineer with a decade of experience in software development, business analysis, project management, and software engineering management. Dedicated to leveraging technology for business growth and success. Let's connect to explore possibilities.",
    "keywords": "alvaro enrique ruano, alvaro ruano, aruanoguate, opportuno tech, ticket genial, software engineer, software engineering manager, technology director, azure certified, azure developer, cloud expert, cloud certified",
    "author": "Alvaro Enrique Ruano",
    "canonical": "https://alvaroruano.me",
    "analytics": {
      "googleAnalyticsId": "G-MENRKMGQ3M"
    }
  }
}